In [1]:
from IPython.display import Image
Image(url="ERD.png")

In [2]:
import sqlalchemy
sqlalchemy.__version__
# imports
import pandas as pd
from sqlalchemy import create_engine
pd.set_option('display.max_columns',50)

In [3]:
# Creating the sqlalchemy engine and connection
username = "root"
password = "Papo69$!" 
# password = quote_plus("Myp@ssword!") # Use the quote function if you have special chars in password
db_name = "books"
connection = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"
engine = create_engine(connection)
conn = engine.connect()

In [4]:
# Previewing the names of all tables 
q = '''SHOW TABLES;'''
pd.read_sql(q, conn)

   Tables_in_books
0           author
1          authors
2             book
3            books
4        favorites
5  favourite_books
6             user
7            users

### Importing authors

In [5]:
authors = pd.read_csv('data/authors.csv')
authors.info()
authors.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           5 non-null      int64
 1   author_name  5 non-null      object
dtypes: int64(1), object(1)
memory usage: 208.0+ bytes

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [6]:
q = '''DESCRIBE authors;'''
describe = pd.read_sql(q, conn)
describe

         Field         Type Null  Key Default Extra
0           id          int   NO  PRI    None
1  author_name  varchar(45)  YES         None

In [7]:
# Checking describe's Field names
describe['Field'].values

array(['id', 'author_name'], dtype=object)

In [8]:
authors.dtypes

id              int64
author_name    object
dtype: object

In [9]:
#inserting data
authors.to_sql("authors",conn,index=False, if_exists='append')

5

In [10]:
# confirm the data has been added
q = """SELECT * FROM authors;"""
pd.read_sql(q,conn)

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

### Importing books

In [11]:
books = pd.read_csv('data/books.csv')
books.info()
books.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   id         6 non-null      int64
 1   title      6 non-null      object
 2   author_id  6 non-null      int64
dtypes: int64(2), object(1)
memory usage: 272.0+ bytes

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [12]:
q = '''DESCRIBE books;'''
describe = pd.read_sql(q, conn)
describe

        Field         Type Null  Key Default Extra
0          id          int   NO  PRI    None
1       title  varchar(45)  YES         None
2  authors_id          int   NO  PRI    None

In [13]:
# Checking describe's Field names
describe['Field'].values

array(['id', 'title', 'authors_id'], dtype=object)

In [14]:
books.dtypes

id            int64
title        object
author_id     int64
dtype: object

In [15]:
books.rename(columns={"author_id":"authors_id"}, inplace=True)

In [16]:
books.dtypes

id             int64
title         object
authors_id     int64
dtype: object

In [17]:
#inserting data
books.to_sql("books",conn,index=False, if_exists='append')

6

In [18]:
# confirm the data has been added
q = """SELECT * FROM books;"""
pd.read_sql(q,conn)

   id                 title  authors_id
0   1           The Shining           1
1   2                    It           1
2   3      The Great Gatsby           2
3   4  The Call of the Wild           3
4   5   Pride and Prejudice           4
5   6          Frankenstein           5

### Favorites

In [19]:
favorites = pd.read_csv('data/favorites.csv')
favorites.info()
favorites.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   user_id  7 non-null      int64
 1   book_id  7 non-null      int64
dtypes: int64(2)
memory usage: 240.0 bytes

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [20]:
q = '''DESCRIBE favorites;'''
describe = pd.read_sql(q, conn)
describe

      Field Type Null  Key Default Extra
0  books_id  int   NO  MUL    None
1  users_id  int   NO  MUL    None

In [21]:
# Checking describe's Field names
describe['Field'].values

array(['books_id', 'users_id'], dtype=object)

In [22]:
favorites.dtypes

user_id    int64
book_id    int64
dtype: object

In [23]:
favorites.rename(columns={"user_id":"users_id"}, inplace=True)

In [24]:
favorites.rename(columns={"book_id":"books_id"}, inplace=True)

In [25]:
#Changing the setting for FOREIGN_KEY_CHECKS with the connection
q = """SET @@FOREIGN_KEY_CHECKS=0"""
conn.execute(q)

In [26]:
# Confirm the checks are deactiavated
q = """SELECT @@FOREIGN_KEY_CHECKS"""
pd.read_sql(q,conn)

   @@FOREIGN_KEY_CHECKS
0                     0

In [27]:
#inserting data
favorites.to_sql("favorites",conn,index=False, if_exists='append')

7

In [28]:
# confirm the data has been added
q = """SELECT * FROM favorites;"""
pd.read_sql(q,conn)

   books_id  users_id
0         1         1
1         2         1
2         3         1
3         4         2
4         5         2
5         5         3
6         6         3

### Importing users

In [29]:
users = pd.read_csv('data/users.csv')
books.info()
books.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          6 non-null      int64
 1   title       6 non-null      object
 2   authors_id  6 non-null      int64
dtypes: int64(2), object(1)
memory usage: 272.0+ bytes

   id                 title  authors_id
0   1           The Shining           1
1   2                    It           1
2   3      The Great Gatsby           2
3   4  The Call of the Wild           3
4   5   Pride and Prejudice           4

In [30]:
q = '''DESCRIBE users;'''
describe = pd.read_sql(q, conn)
describe

        Field         Type Null  Key Default Extra
0          id          int   NO  PRI    None
1  first_name  varchar(45)  YES         None
2   last_name  varchar(45)  YES         None
3       email  varchar(45)  YES         None

In [31]:
# Checking describe's Field names
describe['Field'].values

array(['id', 'first_name', 'last_name', 'email'], dtype=object)

In [32]:
users.dtypes

id             int64
first_name    object
last_name     object
email         object
dtype: object

In [33]:
#inserting data
users.to_sql("users",conn,index=False, if_exists='append')

3

In [34]:
# confirm the data has been added
q = """SELECT * FROM users;"""
pd.read_sql(q,conn)

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

### Testing the Database

In [35]:
# Previewing the names of all tables 
q = '''SHOW TABLES;'''
pd.read_sql(q, conn)

   Tables_in_books
0           author
1          authors
2             book
3            books
4        favorites
5  favourite_books
6             user
7            users

In [36]:
q = """
SELECT books.title, favorites.users_id 
FROM books 
JOIN favorites ON books.id = favorites.books_id 
WHERE favorites.users_id = 
    (SELECT users.id FROM users WHERE (users.last_name = "Doe" AND users.first_name = "John"));
"""
pd.read_sql(q,conn)

              title  users_id
0       The Shining         1
1                It         1
2  The Great Gatsby         1